caseFST/wedgeFstPartialSlip/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2e-6;

deltaT          1e-08;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

functions
{
    sampleLine
    {
        type sets;
        libs            (sampling);

        interpolationScheme cell;

        setFormat       csv;

        sets
        (
            data
            {
                type    uniform;
                axis    x;
                start   (0 0 #calc "float(@!H!@/2)");
                end     (32e-3 0 #calc "float(@!H!@/2)");
                nPoints 200;
            }
        );

        fields          (U);
    }

    forces
    {
        type                  forces;
	libs                  ("libforces.so");
	patches               ("bottom");
	p                     p;
	u                     U;
	CofR                  (0 0 0);
	rho                   rhoInf;
	rhoInf                828;
	outputControl         timeStep;
	outputInterval        10;

    }
}

// ************************************************************************* //
